{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "bca25181-c695-4361-8127-21a8e51de3e2",
   "metadata": {},
   "source": [
    "## Final Training Data\n",
    "\n",
    "Using the output of our Batch process from the previous notebook - we create our final training dataset"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "d36f3cd2-090c-4252-8eb6-cb11dd9c6611",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import re\n",
    "import pandas as pd\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "import os\n",
    "import json\n",
    "from typing import List\n",
    "import os\n",
    "import openai\n",
    "\n",
    "from dotenv import load_dotenv\n",
    "load_dotenv()\n",
    "\n",
    "from langchain_core.pydantic_v1 import BaseModel, Field\n",
    "from langchain_openai import ChatOpenAI\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "\n",
    "\n",
    "os.environ[\"OPENAI_API_KEY\"] = os.environ.get('OPENAI_API_KEY')\n",
    "database = os.getenv('NEO4J_DATABASE')\n",
    "uri, user, password = os.getenv('NEO4J_URI'), os.getenv('NEO4J_USER'),'@PromptEngg'\n",
    "DEMO_URL = uri\n",
    "DEMO_DATABASES = [database];"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "f15332f7-e82d-49aa-9571-2b31e5ad0a04",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>custom_id</th>\n",
       "      <th>response</th>\n",
       "      <th>error</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>batch_req_7b4DtF3MyMdqzud1PSUnnIKS</td>\n",
       "      <td>request-0</td>\n",
       "      <td>{'status_code': 200, 'request_id': '61c2704410...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>batch_req_1y9s4768GYy9OhzsX1xBHBhv</td>\n",
       "      <td>request-1</td>\n",
       "      <td>{'status_code': 200, 'request_id': 'cbf5dc7910...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>batch_req_Xm8fx8BLHY1uCMeEoJSKepYv</td>\n",
       "      <td>request-2</td>\n",
       "      <td>{'status_code': 200, 'request_id': 'd7f080255a...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>batch_req_11qNOU3QfOXyjQRn1w67gxVG</td>\n",
       "      <td>request-3</td>\n",
       "      <td>{'status_code': 200, 'request_id': '5388a58dc4...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>batch_req_HZtYiQ6Cqx9zbE3g4r5pXfng</td>\n",
       "      <td>request-4</td>\n",
       "      <td>{'status_code': 200, 'request_id': '90f1ed5ff8...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>207</th>\n",
       "      <td>batch_req_49d9JjN7dudXWFBbRlZxhpRW</td>\n",
       "      <td>request-207</td>\n",
       "      <td>{'status_code': 200, 'request_id': 'c6a7643900...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>208</th>\n",
       "      <td>batch_req_cgqbvheptVS8TomCrln7o940</td>\n",
       "      <td>request-208</td>\n",
       "      <td>{'status_code': 200, 'request_id': 'b5e5a7570f...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>209</th>\n",
       "      <td>batch_req_uOl2Fg4mi5urKExf3fGQ78fp</td>\n",
       "      <td>request-209</td>\n",
       "      <td>{'status_code': 200, 'request_id': 'f90276cda3...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>210</th>\n",
       "      <td>batch_req_85ZVER9jjwOnuXdtKvWx4WuL</td>\n",
       "      <td>request-210</td>\n",
       "      <td>{'status_code': 200, 'request_id': '26bf22c2f7...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>211</th>\n",
       "      <td>batch_req_gsirLeDWVPViJiS0YROwyiLH</td>\n",
       "      <td>request-211</td>\n",
       "      <td>{'status_code': 200, 'request_id': '0248bdc9dd...</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>212 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                     id    custom_id  \\\n",
       "0    batch_req_7b4DtF3MyMdqzud1PSUnnIKS    request-0   \n",
       "1    batch_req_1y9s4768GYy9OhzsX1xBHBhv    request-1   \n",
       "2    batch_req_Xm8fx8BLHY1uCMeEoJSKepYv    request-2   \n",
       "3    batch_req_11qNOU3QfOXyjQRn1w67gxVG    request-3   \n",
       "4    batch_req_HZtYiQ6Cqx9zbE3g4r5pXfng    request-4   \n",
       "..                                  ...          ...   \n",
       "207  batch_req_49d9JjN7dudXWFBbRlZxhpRW  request-207   \n",
       "208  batch_req_cgqbvheptVS8TomCrln7o940  request-208   \n",
       "209  batch_req_uOl2Fg4mi5urKExf3fGQ78fp  request-209   \n",
       "210  batch_req_85ZVER9jjwOnuXdtKvWx4WuL  request-210   \n",
       "211  batch_req_gsirLeDWVPViJiS0YROwyiLH  request-211   \n",
       "\n",
       "                                              response  error  \n",
       "0    {'status_code': 200, 'request_id': '61c2704410...    NaN  \n",
       "1    {'status_code': 200, 'request_id': 'cbf5dc7910...    NaN  \n",
       "2    {'status_code': 200, 'request_id': 'd7f080255a...    NaN  \n",
       "3    {'status_code': 200, 'request_id': '5388a58dc4...    NaN  \n",
       "4    {'status_code': 200, 'request_id': '90f1ed5ff8...    NaN  \n",
       "..                                                 ...    ...  \n",
       "207  {'status_code': 200, 'request_id': 'c6a7643900...    NaN  \n",
       "208  {'status_code': 200, 'request_id': 'b5e5a7570f...    NaN  \n",
       "209  {'status_code': 200, 'request_id': 'f90276cda3...    NaN  \n",
       "210  {'status_code': 200, 'request_id': '26bf22c2f7...    NaN  \n",
       "211  {'status_code': 200, 'request_id': '0248bdc9dd...    NaN  \n",
       "\n",
       "[212 rows x 4 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Load the JSONL file into a DataFrame\n",
    "df = pd.read_json(\"text2cypher_batch_output.jsonl\", lines=True)\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "6bb1edea-61e2-4ca4-829a-ede5322d9a0d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def extract_text(text):\n",
    "    # Adjust pattern to capture after ```cypher and spans multiple lines until ```\n",
    "    pattern = r\"```cypher\\n(.*?)\\n```\"\n",
    "    match = re.search(pattern, text, re.DOTALL)\n",
    "\n",
    "    if match:\n",
    "        # Return the extracted text if triple backticks are present\n",
    "        return match.group(1).strip()\n",
    "    else:\n",
    "        # Return the original text if triple backticks are not present\n",
    "        return text\n",
    "\n",
    "\n",
    "df[\"cypher\"] = [\n",
    "    extract_text(el[\"body\"][\"choices\"][0][\"message\"][\"content\"])\n",
    "    for el in df[\"response\"]\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "c56e77d7-3885-4099-80fb-ee4cdd0b614b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>type</th>\n",
       "      <th>database</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>What are the top 5 products managed by the Hai...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>List the top 3 products with a molecule test t...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Which 3 products have a pack price greater tha...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Identify the top 5 countries where products wi...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Which vendors supply the top 3 products with t...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                            question  \\\n",
       "0  What are the top 5 products managed by the Hai...   \n",
       "1  List the top 3 products with a molecule test t...   \n",
       "2  Which 3 products have a pack price greater tha...   \n",
       "3  Identify the top 5 countries where products wi...   \n",
       "4  Which vendors supply the top 3 products with t...   \n",
       "\n",
       "                       type database         id  \n",
       "0  Simple Retrieval Queries    neo4j  request-0  \n",
       "1  Simple Retrieval Queries    neo4j  request-1  \n",
       "2  Simple Retrieval Queries    neo4j  request-2  \n",
       "3  Simple Retrieval Queries    neo4j  request-3  \n",
       "4  Simple Retrieval Queries    neo4j  request-4  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "meta_df = pd.read_csv(\"text2cypher_questions.csv\")\n",
    "meta_df[\"id\"] = [f\"request-{el}\" for el, _ in enumerate(meta_df[\"database\"])]\n",
    "meta_df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1ab476dc-112a-4463-9b6d-a528915e6716",
   "metadata": {},
   "source": [
    "## Combining Batch output and Initial Q&A responses"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "a07acca1-f7df-4864-9d75-e46e7deeff38",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id_x</th>\n",
       "      <th>custom_id</th>\n",
       "      <th>response</th>\n",
       "      <th>error</th>\n",
       "      <th>cypher</th>\n",
       "      <th>question</th>\n",
       "      <th>type</th>\n",
       "      <th>database</th>\n",
       "      <th>id_y</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>batch_req_7b4DtF3MyMdqzud1PSUnnIKS</td>\n",
       "      <td>request-0</td>\n",
       "      <td>{'status_code': 200, 'request_id': '61c2704410...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MATCH (o:Office{name: 'Haiti Field Office'})-[...</td>\n",
       "      <td>What are the top 5 products managed by the Hai...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>135</th>\n",
       "      <td>batch_req_HOASyGNA7P4Dlg5esmow1WqA</td>\n",
       "      <td>request-135</td>\n",
       "      <td>{'status_code': 200, 'request_id': '3b2d8f61c7...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MATCH (p:Product)-[:GROUP]-&gt;(pg:Product_Group)...</td>\n",
       "      <td>List the product groups associated with produc...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-135</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>136</th>\n",
       "      <td>batch_req_Wharcr2wPzRrZF5fd68srsrE</td>\n",
       "      <td>request-136</td>\n",
       "      <td>{'status_code': 200, 'request_id': 'fe0396d1f4...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MATCH (p:Product)-[:BRAND]-&gt;(b:Brand)\\nWHERE p...</td>\n",
       "      <td>Show the first 3 brands associated with produc...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-136</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137</th>\n",
       "      <td>batch_req_LhGyiq84K6JVbIOZ19mSz8Ig</td>\n",
       "      <td>request-137</td>\n",
       "      <td>{'status_code': 200, 'request_id': '13714ab017...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MATCH (v:Vendor {name: 'ABBOTT LABORATORIES (P...</td>\n",
       "      <td>Which countries receive products from vendors ...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>138</th>\n",
       "      <td>batch_req_enCVun2gAOqRNCsu4USZcNlR</td>\n",
       "      <td>request-138</td>\n",
       "      <td>{'status_code': 200, 'request_id': '503f2c2bcb...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>MATCH (p:Product)-[:MANAGED_BY]-&gt;(:Office{name...</td>\n",
       "      <td>What are the names of products managed by the ...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>request-138</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   id_x    custom_id  \\\n",
       "0    batch_req_7b4DtF3MyMdqzud1PSUnnIKS    request-0   \n",
       "135  batch_req_HOASyGNA7P4Dlg5esmow1WqA  request-135   \n",
       "136  batch_req_Wharcr2wPzRrZF5fd68srsrE  request-136   \n",
       "137  batch_req_LhGyiq84K6JVbIOZ19mSz8Ig  request-137   \n",
       "138  batch_req_enCVun2gAOqRNCsu4USZcNlR  request-138   \n",
       "\n",
       "                                              response  error  \\\n",
       "0    {'status_code': 200, 'request_id': '61c2704410...    NaN   \n",
       "135  {'status_code': 200, 'request_id': '3b2d8f61c7...    NaN   \n",
       "136  {'status_code': 200, 'request_id': 'fe0396d1f4...    NaN   \n",
       "137  {'status_code': 200, 'request_id': '13714ab017...    NaN   \n",
       "138  {'status_code': 200, 'request_id': '503f2c2bcb...    NaN   \n",
       "\n",
       "                                                cypher  \\\n",
       "0    MATCH (o:Office{name: 'Haiti Field Office'})-[...   \n",
       "135  MATCH (p:Product)-[:GROUP]->(pg:Product_Group)...   \n",
       "136  MATCH (p:Product)-[:BRAND]->(b:Brand)\\nWHERE p...   \n",
       "137  MATCH (v:Vendor {name: 'ABBOTT LABORATORIES (P...   \n",
       "138  MATCH (p:Product)-[:MANAGED_BY]->(:Office{name...   \n",
       "\n",
       "                                              question  \\\n",
       "0    What are the top 5 products managed by the Hai...   \n",
       "135  List the product groups associated with produc...   \n",
       "136  Show the first 3 brands associated with produc...   \n",
       "137  Which countries receive products from vendors ...   \n",
       "138  What are the names of products managed by the ...   \n",
       "\n",
       "                         type database         id_y  \n",
       "0    Simple Retrieval Queries    neo4j    request-0  \n",
       "135       Pathfinding Queries    neo4j  request-135  \n",
       "136       Pathfinding Queries    neo4j  request-136  \n",
       "137       Pathfinding Queries    neo4j  request-137  \n",
       "138       Pathfinding Queries    neo4j  request-138  "
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "combined_df = pd.merge(df, meta_df, left_on=\"custom_id\", right_on=\"id\")\n",
    "combined_df = combined_df.sort_values(by=\"database\")\n",
    "combined_df.head()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d19f9f10-eb9f-4852-a31c-b2e553f11328",
   "metadata": {},
   "source": [
    "## Extracting all the Relevant Examples\n",
    "\n",
    "So based on whether the query gets executed or not we classify each statement with Boolean operations\n",
    "\n",
    "Only if we get many errors like `Neo.ClientError.Statement.TypeError` or `Neo.ClientError.Transaction.TransactionTimedOutClientConfiguration` we make sure such examples are not taken into consideration.\n",
    "\n",
    "\n",
    "**Comparing the following parameters**\n",
    "\n",
    "- Syntax Errors\n",
    "- Timeout Errors\n",
    "- Returning Any Results"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "ed1e154f-2d4f-451b-94c5-19840a45c26a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "neo4j\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 3, column: 8, offset: 62} for query: 'MATCH (p:Product)\\nWHERE p.item_description IS NOT NULL\\nWITH p.product_group AS productGroup, count(DISTINCT p.item_description) AS diversity\\nRETURN productGroup, diversity\\nORDER BY diversity DESC\\nLIMIT 3'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Syntax error in Cypher query: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: Invalid input 'NOT': expected\n",
      "  \"!=\"\n",
      "  \"%\"\n",
      "  \"*\"\n",
      "  \"+\"\n",
      "  \",\"\n",
      "  \"-\"\n",
      "  \"/\"\n",
      "  \"::\"\n",
      "  \"<\"\n",
      "  \"<=\"\n",
      "  \"<>\"\n",
      "  \"=\"\n",
      "  \"=~\"\n",
      "  \">\"\n",
      "  \">=\"\n",
      "  \"AND\"\n",
      "  \"CONTAINS\"\n",
      "  \"ENDS\"\n",
      "  \"IN\"\n",
      "  \"IS\"\n",
      "  \"OR\"\n",
      "  \"STARTS\"\n",
      "  \"XOR\"\n",
      "  \"^\"\n",
      "  \"}\" (line 1, column 82 (offset: 81))\n",
      "\"MATCH (p:Product)-[:WEIGHT]->(:Country {name: 'Afghanistan', shipment_number: IS NOT NULL})\"\n",
      "                                                                                  ^}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: sub_class)} {position: line: 4, column: 7, offset: 106} for query: \"MATCH (p:Product)-[:WEIGHT]->(c:Country)\\nWHERE p.pid IS NOT NULL\\nAND p.item_description IS NOT NULL\\nAND p.sub_class = 'Adult'\\nRETURN DISTINCT c.name\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: sub_class)} {position: line: 2, column: 35, offset: 52} for query: \"MATCH (p:Product)\\nWHERE p.pack_price = '80.0' AND p.sub_class IS NOT NULL\\nRETURN p.sub_class.name\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: sub_class)} {position: line: 3, column: 10, offset: 83} for query: \"MATCH (p:Product)\\nWHERE p.pack_price = '80.0' AND p.sub_class IS NOT NULL\\nRETURN p.sub_class.name\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: sub_class)} {position: line: 3, column: 7, offset: 65} for query: \"MATCH (p:Product)\\nWHERE p.unit_of_measure_per_pack = '30' \\nAND p.sub_class = 'HIV test'\\nRETURN p;\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 3, column: 10, offset: 66} for query: 'MATCH (p:Product)\\nWHERE p.line_item_quantity IS NOT NULL\\nRETURN p.product_group\\nORDER BY toInteger(p.line_item_quantity) DESC\\nLIMIT 3'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Problem at a certain point ---->  79\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 6, column: 10, offset: 161} for query: 'MATCH (p:Product)\\nWHERE p.molecule_test_type IS NOT NULL\\nWITH p, count(p.molecule_test_type) AS numMoleculeTypes\\nORDER BY numMoleculeTypes DESC\\nLIMIT 5\\nRETURN p.product_group, numMoleculeTypes'\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: brand)} {position: line: 3, column: 10, offset: 66} for query: 'MATCH (p:Product)\\nWHERE p.line_item_quantity IS NOT NULL\\nRETURN p.brand, p.line_item_quantity\\nORDER BY toInteger(p.line_item_quantity) DESC\\nLIMIT 3'\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100\n",
      "Syntax error in Cypher query: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: RETURN can only be used at the end of the query (line 3, column 1 (offset: 63))\n",
      "\"RETURN p\"\n",
      " ^}\n",
      "Syntax error in Cypher query: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: A pattern expression should only be used in order to test the existence of a pattern. It should therefore only be used in contexts that evaluate to a boolean, e.g. inside the function exists() or in a WHERE-clause. No other uses are allowed, instead they should be replaced by a pattern comprehension. (line 3, column 15 (offset: 65))\n",
      "\"WITH p, count((p)-[:GROUP]->(:Product_Group)) AS group_count\"\n",
      "               ^}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 4, column: 10, offset: 95} for query: \"MATCH (p:Product)\\nWHERE p.molecule_test_type = 'HIV'\\nWITH p, COUNT(p) AS productCount\\nRETURN p.product_group AS ProductGroup, productCount\\nORDER BY productCount DESC\\nLIMIT 3\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 2, column: 48, offset: 65} for query: \"MATCH (p:Product)\\nWHERE p.shipment_number ENDS WITH '-128' AND p.product_group IS NOT NULL\\nRETURN p.product_group, count(p.product_group) AS total_products\\nORDER BY total_products DESC\\nLIMIT 5\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 3, column: 10, offset: 100} for query: \"MATCH (p:Product)\\nWHERE p.shipment_number ENDS WITH '-128' AND p.product_group IS NOT NULL\\nRETURN p.product_group, count(p.product_group) AS total_products\\nORDER BY total_products DESC\\nLIMIT 5\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 3, column: 33, offset: 123} for query: \"MATCH (p:Product)\\nWHERE p.shipment_number ENDS WITH '-128' AND p.product_group IS NOT NULL\\nRETURN p.product_group, count(p.product_group) AS total_products\\nORDER BY total_products DESC\\nLIMIT 5\"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: sub_class)} {position: line: 2, column: 9, offset: 49} for query: \"MATCH (p:Product)-[:WEIGHT]->(c:Country)\\nWHERE p.sub_class = 'HIV test' AND p.shipment_number IS NOT NULL\\nRETURN c.name, count{(p)-[:WEIGHT]->(c)} AS shipment_count\\nORDER BY shipment_count DESC\\nLIMIT 3\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Syntax error in Cypher query: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: In a WITH/RETURN with DISTINCT or an aggregation, it is not possible to access variables declared before the WITH/RETURN: p (line 5, column 10 (offset: 126))\n",
      "\"ORDER BY p.pid\"\n",
      "          ^}\n",
      "Syntax error in Cypher query: Generated Cypher Statement is not valid\n",
      "{code: Neo.ClientError.Statement.SyntaxError} {message: A pattern expression should only be used in order to test the existence of a pattern. It should therefore only be used in contexts that evaluate to a boolean, e.g. inside the function exists() or in a WHERE-clause. No other uses are allowed, instead they should be replaced by a pattern comprehension. (line 3, column 15 (offset: 68))\n",
      "\"WITH p, count((p)-[:GROUP]->(:Product_Group)) AS group_count\"\n",
      "               ^}\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: product_group)} {position: line: 3, column: 10, offset: 68} for query: \"MATCH (p:Product)\\nWHERE p.shipment_number STARTS WITH 'DN'\\nRETURN p.product_group\\nORDER BY p.pid\\nLIMIT 3;\"\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "200\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: sub_class)} {position: line: 2, column: 9, offset: 49} for query: \"MATCH (p:Product)-[:WEIGHT]->(c:Country)\\nWHERE p.sub_class = 'HIV test - Ancillary' AND p.shipment_number IS NOT NULL\\nRETURN DISTINCT c.name\"\n"
     ]
    }
   ],
   "source": [
    "syntax_error = []\n",
    "returns_results = []\n",
    "actual_errors = []\n",
    "timeouts = []\n",
    "last_graph = \"\"\n",
    "for i, row in combined_df.reset_index().iterrows():\n",
    "    if i % 100 == 0:\n",
    "        print(i)\n",
    "    # To avoid a new driver for every request\n",
    "    if row[\"database\"] != last_graph:\n",
    "        last_graph = row[\"database\"]\n",
    "        print(last_graph)\n",
    "        graph = Neo4jGraph(\n",
    "            url=DEMO_URL,\n",
    "            username=user,\n",
    "            password=password,\n",
    "            database=row[\"database\"],\n",
    "            refresh_schema=False,\n",
    "            timeout=10,\n",
    "        )\n",
    "    try:\n",
    "        data = graph.query(row[\"cypher\"])\n",
    "        if data:\n",
    "            returns_results.append(True)\n",
    "        else:\n",
    "            returns_results.append(False)\n",
    "        syntax_error.append(False)\n",
    "        timeouts.append(False)\n",
    "    except ValueError as e:\n",
    "        if ((\"Generated Cypher Statement is not valid\" in str(e)) | (\"Neo.ClientError.Statement.TypeError\" in str(e))):\n",
    "            syntax_error.append(True)\n",
    "            print(f\"Syntax error in Cypher query: {e}\")\n",
    "        else:\n",
    "            syntax_error.append(False)\n",
    "            print(f\"Other ValueError: {e}\")\n",
    "        returns_results.append(False)\n",
    "        timeouts.append(False)\n",
    "    except Exception as e:\n",
    "        if (\n",
    "            e.code\n",
    "            == \"Neo.ClientError.Transaction.TransactionTimedOutClientConfiguration\"\n",
    "        ):\n",
    "            returns_results.append(False)\n",
    "            syntax_error.append(False)\n",
    "            timeouts.append(True)\n",
    "\n",
    "    if len(syntax_error)!=(i+1):\n",
    "        print(\"Problem at a certain point ----> \",str(i+1))\n",
    "        #break\n",
    "        returns_results.append(False)\n",
    "        timeouts.append(False)\n",
    "        syntax_error.append(False)\n",
    "        actual_errors.append(i)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "3149b4f3-91d5-49ae-bd52-d0955ebde505",
   "metadata": {},
   "outputs": [],
   "source": [
    "combined_df[\"syntax_error\"] = syntax_error\n",
    "combined_df[\"timeout\"] = timeouts\n",
    "combined_df[\"returns_results\"] = returns_results"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "52923cac-c028-4c6d-a954-3d9f028d6471",
   "metadata": {},
   "source": [
    "## Extracting Relevant Columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "7fe4e8e6-34f4-4a1b-83ae-d375f9bd71f2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>question</th>\n",
       "      <th>cypher</th>\n",
       "      <th>type</th>\n",
       "      <th>database</th>\n",
       "      <th>syntax_error</th>\n",
       "      <th>timeout</th>\n",
       "      <th>returns_results</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>What are the top 5 products managed by the Hai...</td>\n",
       "      <td>MATCH (o:Office{name: 'Haiti Field Office'})-[...</td>\n",
       "      <td>Simple Retrieval Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>135</th>\n",
       "      <td>List the product groups associated with produc...</td>\n",
       "      <td>MATCH (p:Product)-[:GROUP]-&gt;(pg:Product_Group)...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>136</th>\n",
       "      <td>Show the first 3 brands associated with produc...</td>\n",
       "      <td>MATCH (p:Product)-[:BRAND]-&gt;(b:Brand)\\nWHERE p...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137</th>\n",
       "      <td>Which countries receive products from vendors ...</td>\n",
       "      <td>MATCH (v:Vendor {name: 'ABBOTT LABORATORIES (P...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>138</th>\n",
       "      <td>What are the names of products managed by the ...</td>\n",
       "      <td>MATCH (p:Product)-[:MANAGED_BY]-&gt;(:Office{name...</td>\n",
       "      <td>Pathfinding Queries</td>\n",
       "      <td>neo4j</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              question  \\\n",
       "0    What are the top 5 products managed by the Hai...   \n",
       "135  List the product groups associated with produc...   \n",
       "136  Show the first 3 brands associated with produc...   \n",
       "137  Which countries receive products from vendors ...   \n",
       "138  What are the names of products managed by the ...   \n",
       "\n",
       "                                                cypher  \\\n",
       "0    MATCH (o:Office{name: 'Haiti Field Office'})-[...   \n",
       "135  MATCH (p:Product)-[:GROUP]->(pg:Product_Group)...   \n",
       "136  MATCH (p:Product)-[:BRAND]->(b:Brand)\\nWHERE p...   \n",
       "137  MATCH (v:Vendor {name: 'ABBOTT LABORATORIES (P...   \n",
       "138  MATCH (p:Product)-[:MANAGED_BY]->(:Office{name...   \n",
       "\n",
       "                         type database  syntax_error  timeout  returns_results  \n",
       "0    Simple Retrieval Queries    neo4j         False    False             True  \n",
       "135       Pathfinding Queries    neo4j         False    False            False  \n",
       "136       Pathfinding Queries    neo4j         False    False             True  \n",
       "137       Pathfinding Queries    neo4j         False    False             True  \n",
       "138       Pathfinding Queries    neo4j         False    False            False  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "final_df = combined_df[\n",
    "    [\n",
    "        \"question\",\n",
    "        \"cypher\",\n",
    "        \"type\",\n",
    "        \"database\",\n",
    "        \"syntax_error\",\n",
    "        \"timeout\",\n",
    "        \"returns_results\",\n",
    "    ]\n",
    "]\n",
    "final_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "710660aa-7ffb-490d-87fd-423ba9f5e840",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Distribution for syntax_error:\n",
      " syntax_error\n",
      "False    207\n",
      "True       5\n",
      "Name: count, dtype: int64\n",
      "Distribution for timeout:\n",
      " timeout\n",
      "False    208\n",
      "True       4\n",
      "Name: count, dtype: int64\n",
      "Distribution for returns_results:\n",
      " returns_results\n",
      "True     131\n",
      "False     81\n",
      "Name: count, dtype: int64\n"
     ]
    }
   ],
   "source": [
    "# Assume df is your DataFrame and col1, col2, col3 are the boolean columns\n",
    "distribution_col1 = final_df[\"syntax_error\"].value_counts()\n",
    "distribution_col2 = final_df[\"timeout\"].value_counts()\n",
    "distribution_col3 = final_df[\"returns_results\"].value_counts()\n",
    "\n",
    "print(\"Distribution for syntax_error:\\n\", distribution_col1)\n",
    "print(\"Distribution for timeout:\\n\", distribution_col2)\n",
    "print(\"Distribution for returns_results:\\n\", distribution_col3)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "36b52b72-8bc0-4b6a-b9cc-deee8f22efee",
   "metadata": {},
   "source": [
    "## Final Output\n",
    "\n",
    "This output file is built using GPT 3.5 and is used as the input for training our model"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "88b10189-c8a2-415f-9a15-3471fe82e714",
   "metadata": {},
   "outputs": [],
   "source": [
    "final_df.to_csv(\"text2cypher_gpt3.5turbo.csv\", index=False)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.14"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
